In [1]:
import numpy as np
import pandas as pd
myarray = pd.Series([1,2,3,4,5,np.nan,None])
# nan和none都当做缺失数据处理
myarray

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    NaN
dtype: float64

In [2]:
myarray.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [3]:
myarray.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [4]:
myarray.dropna()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [7]:
df = pd.DataFrame([[1,2,3,4,np.nan],
                   [5,6,np.nan,np.nan,np.nan],
                   [51,61,np.nan,np.nan,78],
                   [100,200,300,400,500]])

In [8]:
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [9]:
df.dropna()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [12]:
df.drop(1,axis=1)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
df.fillna(method="ffill",axis=1)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.0</td>
      <td>2.0</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>4.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5.0</td>
      <td>6.0</td>
      <td>6.0</td>
      <td>6.0</td>
      <td>6.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51.0</td>
      <td>61.0</td>
      <td>61.0</td>
      <td>61.0</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100.0</td>
      <td>200.0</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [13]:
df.dropna(axis=1)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
    </tr>
  </tbody>
</table>
</div>

In [14]:
df.dropna(axis=1,how='any')  # any只要有一列为空就删掉,all所有列都为空才删掉

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
    </tr>
  </tbody>
</table>
</div>

In [17]:
data = pd.Series([1,np.nan,36,'kiwi',None],index=list('ABCDE'))
data

A       1
B     NaN
C      36
D    kiwi
E    None
dtype: object

In [18]:
data.fillna(0)

A       1
B       0
C      36
D    kiwi
E       0
dtype: object

In [23]:
data = pd.Series([1,np.nan,3,None,np.nan,5],index=list('ABCDEF'))
data

A    1.0
B    NaN
C    3.0
D    NaN
E    NaN
F    5.0
dtype: float64

In [24]:
data.fillna(method="ffill")  # 前面

A    1.0
B    1.0
C    3.0
D    3.0
E    3.0
F    5.0
dtype: float64

In [25]:
data.fillna(method='bfill') # 后面

A    1.0
B    3.0
C    3.0
D    5.0
E    5.0
F    5.0
dtype: float64